/*
.####.##....##..######..##.......##.....##.########..########
..##..###...##.##....##.##.......##.....##.##.....##.##......
..##..####..##.##.......##.......##.....##.##.....##.##......
..##..##.##.##.##.......##.......##.....##.##.....##.######..
..##..##..####.##.......##.......##.....##.##.....##.##......
..##..##...###.##....##.##.......##.....##.##.....##.##......
.####.##....##..######..########..#######..########..########
*/
#include <Arduino.h>
#include <SoftwareSerial.h>                           // Библиотека програмной реализации обмена по UART-протоколу
#include <EEPROM.h>
#include <Ticker.h>
#include <OneWire.h>
#include <DallasTemperature.h>

#include <main.h>
#include <functions.cpp>
#include <phone_func.cpp>

/*
..######..########.########.##.....##.########.
.##....##.##..........##....##.....##.##.....##
.##.......##..........##....##.....##.##.....##
..######..######......##....##.....##.########.
.......##.##..........##....##.....##.##.......
.##....##.##..........##....##.....##.##.......
..######..########....##.....#######..##.......
*/
void setup() {
  // for (int i = 0 ; i < EEPROM.length() ; i++) {    //CLEAR EEPROM
  //   EEPROM.write(i, 0);
  // }

  Serial.begin(9600);                                 // Скорость обмена данными с компьютером
  SIM800.begin(9600);                                 // Скорость обмена данными с модемом

  sensor.begin();
  sensor.setResolution(10);

  Serial.println("Start!");

  sendATCommand("AT", true);                          // Проверка общего статуса
  sendATCommand("AT+CLIP=1", true);                   // Включить АОН
  sendATCommand("AT+DDET=1,0,1", true);               // Включаем DTMF
  sendATCommand("AT+CMGF=1;&W", true);                // вкючаем тесктовый режим СМС
  sendATCommand("AT+FSLS=C:\\User\\", true);          //показать файлы в хранилищ
  sendATCommand("AT+CREC=8", true);                   //показать свободное пространство хранилища

  // sendATCommand("AT+FSDEL=C:\\User\\2.amr", true);       // Удалить файл из системы

  temp = readStringFromEEPROM(0).toFloat();
  gest = readStringFromEEPROM(20).toFloat();
  phone = readStringFromEEPROM(40);

  checkTempTimer.start();
}

/*
.##........#######...#######..########.
.##.......##.....##.##.....##.##.....##
.##.......##.....##.##.....##.##.....##
.##.......##.....##.##.....##.########.
.##.......##.....##.##.....##.##.......
.##.......##.....##.##.....##.##.......
.########..#######...#######..##.......
*/
void loop() {
  waitTimer.update();
  checkTempTimer.update();

  CheckDTMF();
  CheckSMS(); 
  CheckSendSMS();  
  CheckTemp();
}

/*
.########.##....##.########.....
.##.......###...##.##.....##....
.##.......####..##.##.....##....
.######...##.##.##.##.....##....
.##.......##..####.##.....##....
.##.......##...###.##.....##.###
.########.##....##.########..###
*/